# Glossiness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..Glossiness Property
MaterialNode Class See Also
---
The level of glossiness of the material
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Glossiness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Glossiness As Integer
	Get
```

Visual C++
---
```text
public:
property int Glossiness {
	int get ();
}
```

# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace